C2LP-Assistant/C2LP.Assistant.TMSConsole/bin/Debug/AccessRecord/Node_20170728143658_HD123456.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.webservice.vtradex.com" > <soapenv:Header/><soapenv:Body><ser:tmsShipmentInTransitXml><?xml version="1.0"?>
<XML xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <MESSAGEHEAD>
    <SENDER>NBJC01160122</SENDER>
    <FILETYPE>XML</FILETYPE>
    <CONTENTTYPE>CarrierTrackRecord</CONTENTTYPE>
    <SENDTIME>2017-07-28 14:35:43</SENDTIME>
    <FILENAME>20170728143543</FILENAME>
    <FILEFUNCTION>ADD</FILEFUNCTION>
  </MESSAGEHEAD>
  <MESSAGEDETAIL><![CDATA[<?xml version="1.0"?>
<XML xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <CONTENTLIST>
    <CONTENT>
      <HEADER />
      <DETAILLIST>
        <DETAIL>
          <ECNO>161109060</ECNO>
          <CECNO>HD123456</CECNO>
          <LEGNO>HD123456</LEGNO>
          <TRACKTIME>2017-07-27 09:50:09</TRACKTIME>
          <TRACKPERSON>邵铁刚</TRACKPERSON>
          <TRACKINFO>【浙BD31Y8】 配送员【邵铁刚】已收取快件 准备运往【丽水】</TRACKINFO>
          <TRACKTYPE>15</TRACKTYPE>
        </DETAIL>
      </DETAILLIST>
    </CONTENT>
  </CONTENTLIST>
</XML>]]></MESSAGEDETAIL>
</XML></ser:tmsShipmentInTransitXml></soapenv:Body></soapenv:Envelope>

-------------------------------------------------------------------------

<?xml version="1.0" encoding="UTF-8"?><XML><MSGCODE>0</MSGCODE><MSGCONTENT>在TMS找不到指定的运单HD123456</MSGCONTENT><MSGNAME>20170728143543</MSGNAME></XML>